# GetNumWallPeaks

## Description
Returns the number of peaks in the referenced wall.

```pascal
FUNCTION GetNumWallPeaks(h : HANDLE) : INTEGER;
```

```python

def vs.GetNumWallPeaks(h):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to wall.|

## Returns
Returns the number of wall peaks.

## Remarks
return number of peaks in wall

## Version
Availability: from VectorWorks9.0
## Category
* Objects - Walls